Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd
df = pd.Series([4, 8, 15, 16, 23,42])
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [12]:
my_list=list(range(51,61))
df1=pd.Series(my_list)

df1

0    51
1    52
2    53
3    54
4    55
5    56
6    57
7    58
8    59
9    60
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [14]:
data ={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}
df3=pd.DataFrame(data)
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans. In pandas, a DataFrame is a two-dimensional tabular data structure that consists of labeled columns and indexed rows. It can be thought of as a table or a spreadsheet where each column represents a variable or feature, and each row represents an observation or data point.

On the other hand, a pandas Series is a one-dimensional labeled array that can hold any data type. It is similar to a column in a DataFrame and can be seen as a single column of data with an associated index. Essentially, a Series is a single column of a DataFrame.

Here's an example to illustrate the difference between a DataFrame and a Series:

In [15]:
data ={
    'Name':['Jayant','Yash','Vansh'],
    'Skills':['Python','Django','Java']
}
df3=pd.DataFrame(data)
df3

     Name  Skills
0  Jayant  Python
1    Yash  Django
2   Vansh    Java

In [16]:
my_list=['hi','kaise','ho','aap']
df1=pd.Series(my_list)

df1

0       hi
1    kaise
2       ho
3      aap
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Ans. Pandas provides a wide range of functions to manipulate and transform data in a DataFrame. Here are some common functions:
head(),tail(),describe(),sort_values() and groupby(),etc.

In [21]:
df3.head()

     Name  Skills
0  Jayant  Python
1    Yash  Django
2   Vansh    Java

In [24]:
df3.sort_values('Name')

     Name  Skills
0  Jayant  Python
2   Vansh    Java
1    Yash  Django

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans. In Pandas, both Series and DataFrame are mutable in nature, while Panel is not.

Mutable means that the object can be modified after it is created. In the case of Series and DataFrame, you can modify the existing values, add or remove columns or rows, and perform various operations that change the underlying data.

For example, you can update the values in a Series or DataFrame using indexing or assignment:

In [25]:
import pandas as pd

# Create a Series
s = pd.Series([1, 2, 3, 4])

# Update a value in the Series
s[2] = 5
print(s)

0    1
1    2
2    5
3    4
dtype: int64

Q7. Create a DataFrame using multiple Series. Explain with an example.